#include <stdio.h>

/*
Напишіть і протестуйте функцію обміну значеннями двох змінних
(Лекція 7). Змінити тіло функції обміну так, щоб не використовувалась
третя змінна.
Напишіть і протестуйте другий варіант функції (прототип, визначення
та виклик) так, щоб нові значення змінних було видно в функції main().
*/



void swap(int *fa, int *fb)
{
    int temp; // створюємо тимчасову змінну для зберігання значення однєї зі змінних
    temp = *fa;
    *fa = *fb;
    *fb = temp;
}

int main()
{
    int a = 5, b = 7;
    printf("at first a = %d, b = %d\n", a , b);
    swap(&a, &b); // приймаємо кокретно адресу

    printf("now a = %d, b = %d\n", a, b);

    return 0;
}

