#include <stdio.h>


/*

Обчисліть суму ряду 1/2+1/4+1/8+1/16+... із заданою точністю (точність
задає користувач), тобто наступний член не повинен перевищувати
вказану точність.

*/

int main(){


    double precision; // змінна для зберігання заданої точності
    double term = 0.5; // початковий член ряду
    double sum = 0.0;  // змінна для зберігання суми ряду

    //  введення точності
    printf("Введіть точність обчислення (наприклад, 0.001): "); 
    scanf("%lf", &precision);

    // перевіряємо, чи точність введена коректно
    if (precision <= 0) {
        printf("The precision must be the positiv number\n");
        return 1;
    }

    // обчислюємо суму ряду з врахуванням заданої точності
    while (term > precision) {
        sum += term;       // додаємо поточний член до суми
        term /= 2.0;       // наступний член ряду - половина поточного
    }

  
    printf("sum: %.10f\n", sum);
    return 0;


    return 0;
}